---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetVersionHistory
source: html/0d114b0b-a839-1158-b570-d264cca43100.htm
---
# Autodesk.Revit.DB.FabricationPart.GetVersionHistory Method

Gets a history of version change information about the current part.

## Syntax (C#)
```csharp
public IList<FabricationVersionInfo> GetVersionHistory()
```

## Returns
A list of version information about the current part. The list starts with the most recent changes.